Revit 2026 API

# StairsActualRisersNumber Property

---

The total number of actually created risers in model.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ActualRisersNumber { get; }
```
```vb
Public ReadOnly Property ActualRisersNumber As Integer
	Get
```
```cpp
public:
property int ActualRisersNumber {
	int get ();
}
```
```fsharp
member ActualRisersNumber : int with get
```

#### Property Value

Int32

The number of steps needed to go through when moving from the base level to the top level of the stairs.

#### Reference

Stairs Class

Autodesk.Revit.DB.Architecture Namespace